{
    "name": "ERGA_SAMPLE_MANIFEST_SCHEMA",
    "version":"0.0.1",
    "fields":{
        "TUBE_OR_WELL_ID":{
            "description": "This field should record the FluidX barcode for each tube in a rack (or each well in a plate, where relevant) if available, else the position of the well if submitted in a well plate or the label on the submitted tubes. If barcodes are entered, use a barcode scanner in advance of preparing samples to reduce errors, do not enter barcodes manually. IMPORTANT: this field will be the unique identifier to track the sample status when published", 
            "type": "text_field", 
            "mandatory": "mandatory",
            "ENA_submission": false
        },
        "SAMPLE_COORDINATOR":{
            "description":"Also known as the ERGA ambassador, Enter the name of the person or people who is responsible for the genome project of the sample using all CAPITALS, and separate names with '|' vertical pipe symbol), e.g., 'CAROLUS LINNAEUS | JEAN_BAPTISTE LAMARCK'.",
            "type": "text_field", 
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "SAMPLE_COORDINATOR_AFFILIATION":{
            "description": "Free text field to supply the university, institution, or society that is responsible for the genome project of the sample. This is typically the society or institution of the person(s) specified in the SAMPLE_COORDINATOR field. If multiple people are specified in COLLECTED_BY, ensure that their institutional affiliations are also separated by a vertical pipe symbol. Position in the list of affiliations should match the person in the same position in the list of names (e.g., PERSON A | PERSON X | PERSON C will have their affiliations as: (INSTITUTE A | INSTITUTE X | INSTITUTE C). If multiple people are listed but all from the same affiliation, no need to repeat the affiliation.,",
            "type": "text_field", 
            "mandatory": "optional",
            "ENA_submission": true
        },
        "SAMPLE_COORDINATOR_ORCID_ID":{
            "description":"Enter the 16 digits ORCID ID of the person or people who is responsible for the genome project of the sample",
            "type": "text_field", 
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "SPECIMEN_ID":{
            "description":"This is a unique identifier that refers to the genetic identity of the supplied material. It is assumed that the ERGA SPECIMEN_ID refers to a singular genetic individual. If the same individual specimen is split into several samples submitted in separate tubes, the ERGA SPECIMEN_ID for these samples would be the same. If multiple individuals of a species are sampled (e.g., from the same population), they must be placed in multiple, individual tubes, each with a unique ERGA SPECIMEN_ID. If sampling from organisms where distinguishing genetic individuals is difficult (e.g., mat-forming species like mosses or bryozoans), tease out individual units as far as is possible (e.g., single strands from a moss mat), and place each in a separate specimen tube with a unique ERGA SPECIMEN_ID. Each ERGA specimen must be linked to a standardized, unique ID that begins with the prefix ERGA_ followed by SPECIES AMBASSADOR INITIALS (up to 10 letters out of A-Z, if this is not possible please reach out to samples@erga-biodiversity.eu)_underscore and SPECIES AMBASSADORS AFFILIATION COUNTRY (alpha 2 ISO3166 letter codes, in case your place of affiliation has no ISO3166 letter code13 Recording Sample Metadata for ERGA please reach out to samples@erga-biodiversity.eu XXXX to integrate an appropriate 2 letter code for you) and _underscore running numbers (e.g. if you as ambassador register more than one sample make sure to use 01, 02…). SPECIMEN_IDs must be unique to an individual (e.g., ERGA_XY_DE_01 cannot be used again after it has been assigned to a specimen). SPECIMEN_IDs must follow the format described above",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "ORDER_OR_GROUP":{
            "description":"The taxonomic Order into which the Family is placed or (if this is not defined) the monophyletic group to which the Family or Genus belongs. This should correspond to the taxonomy as represented in the NCBI Taxonomy Database. If you or your taxonomist have a disagreement with the taxonomy represented on NCBI Taxonomy Database, please raise this with the NCBI TaxonomyDB curators as described below.",
            "type": "text_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "FAMILY":{
            "description":"The taxonomic Family into which the Genus is placed. This should correspond to the taxonomy as represented in the NCBI Taxonomy Database. If you or your taxonomist have a disagreement with the taxonomy represented on NCBI Taxonomy Database, please raise this with the NCBI TaxonomyDB curators as described below",
            "type": "text_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "GENUS":{
            "description":"The taxonomic Genus to which the Species belongs. This should correspond to the taxonomy as represented in the NCBI Taxonomy Database, and with the generic component of the scientific name given below. If you or your taxonomist have a disagreement with the taxonomy represented on NCBI Taxonomy Database, please raise this with the NCBI TaxonomyDB curators as described below",
            "type": "text_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "TAXON_ID":{
            "description":"A valid NCBI TAXON_ID to the species level is mandatory in order to submit data to public repositories. The species name in the manifest must be identical to that listed in the “current name” box in the Taxonomy Browser for that species. If this is not the case, you must write to ena-dtol@ebi.ac.uk to request the change",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "SCIENTIFIC_NAME":{
            "description":"The latin binomial/combined genus and species name with a space in between.",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "TAXON_REMARKS":{
            "description":"Free text to summarise any known issues with the mapping of TAXON_ID to SCIENTIFIC_NAME or add other taxon database identifiers here e.g., EukRef. Here you can also comment on STRAIN availability, if the specimen is a representative of a living and accessible strain/colony/culture. If there are no issues, leave this field blank",
            "type": "text_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "INFRASPECIFIC_EPITHET":{
            "description": "Where the sample is from a formally named infraspecific taxon, give the infraspecific name here, with prefixes in the following format: ssp. (for subspecies), var. (for variety), cv. (for cultivar), br. (for breed). Entries in this field should reflect organisms that can be found living outside of laboratories (see next attribute for lab strains). If there is no epithet here, leave this field blank.",
            "type": "text_choice_field", 
            "mandatory": "optional", 
            "options":["ssp","var","cv","vr", " "],
            "ENA_submission": false
        },
        "CULTURE_OR_STRAIN_ID":{
            "description": "Please give the reference ID from the source culture collection, such that the culture accession can be found in the collection’s database. This is only relevant if the sequenced material is derived from a living, culturable, named laboratory strain (e.g., Anopheles coluzzii N'Gousso strain). This field should not be used to record a variant or type that has been collected anew from the wild: such information should be placed in OTHER_INFORMATION. Leave this field blank if it is not relevant",
            "type": "text_field", 
            "mandatory": "optional",
            "ENA_submission": true
        }, 
        "COMMON_NAME":{
            "description":"Vernacular name, if the species has one. If multiple names are required, separate names with a | (vertical pipe) character. If you are unsure of or the species has no vernacular name leave this field blank.",
            "type": "text_area_field", 
            "mandatory": "optional",
            "ENA_submission": false
        },
        "LIFESTAGE": {
            "description":"The age class or life stage of the organism at the time of collection.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["ADULT", "JUVENILE", "PUPA", "LARVA", "ZYGOTE", "EMBRYO", "EGG","SPOROPHYTE","GAMETOPHYTE","SPORE_BEARING_STRUCTURE","VEGETATIVE_STRUCTURE","VEGETATIVE_CELL","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED"],
            "ENA_submission": true
        },
        "SEX":{ 
            "description":"Sex of the organism from which the sample was obtained'",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["FEMALE","MALE","HERMAPHRODITE_MONOECIOUS","NOT_COLLECTED","NOT_APPLICABLE","NOT _PROVIDED"],
            "ENA_submission": true
        },
        "ORGANISM_PART":{
            "description":"The part of organism's anatomy or substance arising from an organism from which the biomaterial was derived, excludes cells.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["WHOLE_ORGANISM","THORAX","ABDOMEN","CEPHALOTHORAX","BRAIN","EYE","FAT_BODY","INTESTINE","BODYWALL","TERMINAL_BODY","ANTERIOR_BODY","POSTERIOR_BODY","HEPATOPANCREAS","BLOOD","LUNG","HEART","KIDNEY","LIVER","ENDOCRINE_TISSUE","SPLEEN","STOMACH","PANCREAS","MUSCLE","MODULAR_COLONY","TENTACLE","FIN","SKIN","SCAT","EGGSHELL","SCALES","MOLLUSC_FOOT","HAIR","GILL_ANIMAL","OVIDUCT","GONAD","OVARY_ANIMAL","TESTIS","SPERM_SEMINAL_FLUID","EGG","WHOLE_PLANT","SEEDLING","SEED","LEAF","FLOWER","BLADE","STEM","PETIOLE","SHOOT","BUD","THALLUS_PLANT","BRACT","MYCELIUM","MYCORRHIZA","SPORE_BEARING_STRUCTURE","HOLDFAST_FUNGI","STIPE","CAP","GILL_FUNGI","THALLUS_FUNGI","SPORE","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED","UNICELLULAR_ORGANISMS_IN_CULTURE","MULTICELLULAR_ORGANISMS_IN_CULTURE"],
            "ENA_submission": true
        },
        "SYMBIONT":{
            "description": "This is to indicate whether the sample contains a known endo- or ectosymbiont (i.e., you have metadata for it and a species-level and ENA-submittable TAXON ID). Select “TARGET” if only the “host” metadata is known OR if it is a symbiont-only culture. Select “SYMBIONT” if you have a known symbiont in the sample and you have metadata (including, critically, a species-level identification supported by a valid taxon ID) for the symbiont. If you need to select “SYMBIONT” you will then need to copy and paste your “TARGET” row and amend the following fields to reflect the symbiont data:ORDER_OR_GROUP, FAMILY, GENUS, TAXON_ID, SCIENTIFIC_NAME,TAXON_REMARKS,INFRASPECIFIC_EPITHET,CULTURE_OR_STRAIN_ID,COMMON_NAME, LIFESTAGE, SEX, ORGANISM_PART. If there is no explicit information on potential symbionts, this field should be left blank.", 
            "type": "text_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "RELATIONSHIP":{
            "description": "indicates if the specimen has a known parental, child, or sibling relationship to any other specimens.",
            "type": "text_field", 
            "mandatory": "optional",
            "ENA_submission": true
        },
        "GAL":{
            "description":"The name (or acronym) of the genome acquisition lab responsible for the sample.",
            "type": "text_choice_field", 
            "mandatory": "optional",
            "options":["SANGER INSTITUTE","EARLHAM INSTITUTE","CNAG","SCILIFELAB","WGGC","NCCT","DRESDEN CONCEPT","FGC ZURICH","GENOSCOPE","GTF LAUSANNE","HELSINKI GENOMICS CORE FACILITY","NGS BERN","NORWEGIAN SEQUENCING CENTRE","UNIVERSITY OF BARI","UNIVERSITY OF FLORENCE","NEUROMICS SUPPORT FACILITY VIB","GIGAGENOMICS CORE UNIVERSITY LIEGE"],
            "ENA_submission": true
        },
        "GAL_SAMPLE_ID":{
            "description": "unique name assigned to the sample by the genome acquisition lab.",
            "type": "text_field", 
            "mandatory": "optional",
            "ENA_submission": true
        },
        "COLLECTOR_SAMPLE_ID":{
            "description": "unique name assigned to the sample by the COLLECTOR or COLLECTOR_AFFILIATION.", 
            "type": "text_field", 
            "mandatory": "optional",
            "ENA_submission": false
        },
        "COLLECTED_BY":{
            "description": "name of persons or institute who collected the specimen",
            "type": "text_area_field", 
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "COLLECTOR_AFFILIATION":{
            "description":"Free text field to supply the university, institution, or society that is responsible for the collected specimen. This is typically the society or institution of the person(s) specified in the COLLECTED_BY field. If multiple people are specified in COLLECTED_BY, ensure that their institutional affiliations are also separated by a vertical pipe symbol. Position in the list of affiliations should match the person in the same position in the list of names (e.g., PERSON A | PERSON X | PERSON C will have their affiliations as: (INSTITUTE A | INSTITUTE X | INSTITUTE C). If multiple people are listed but all from the same affiliation, no need to repeat the affiliation",
            "type": "text_area_field", 
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "COLLECTOR_ORCID_ID":{
            "description":"Enter the 16 digits ORCID ID of the person or people who is responsible for the genome project of the sample",
            "type": "text_field", 
            "mandatory": "mandatory", 
            "ENA_submission": false
        },
        "DATE_OF_COLLECTION":{
            "description": "The date of sampling, either as an instance (single point in time) or interval. In case no exact time is available, the date/time can be right truncated i.e. all of these are valid ISO8601 compliant times: 2008-01-23T19:23:10+00:00; 2008-01-23T19:23:10; 2008-01-23; 2008-01; 2008.", 
            "type": "text_field", 
            "mandatory": "mandatory", 
            "ENA_submission": true
        },
        "COLLECTION_LOCATION":{
            "description":"General description of the location. This should start with the geographical origin of the sample country as defined by the country or sea in agreement with ISNDC country list (look up accepted country names here https://www.ebi.ac.uk/ena/browser/view/ERC000053), but also include more specific locations (e.g., “Barton’s Pond”) ranging from least to most specific and separated by | character, e.g., “United Kingdom | East Anglia | Norfolk | Norwich | University of East Anglia | UEA Broad”. It is important to give the name of the site here if possible",
            "type": "text_area_field", 
            "mandatory": "mandatory", 
            "ENA_submission": true
        },
        "ORIGINAL_COLLECTION_DATE":{
            "description": "For use if the specimen is from a zoo, botanic garden, culture collection etc. and has a known original date of collection. In case no exact time is available, the date/time can be right truncated i.e. all of these are valid ISO8601 compliant times: 2008-01-23T19:23:10+00:00; 2008-01-23T19:23:10; 2008-01-23; 2008-01; 2008.",
            "type": "text_field", 
            "mandatory": "optional", 
            "ENA_submission": true
        },
        "ORIGINAL_GEOGRAPHIC_LOCATION":{
            "description": "If the specimen is from a zoo, botanic garden, culture collection and has a known origin elsewhere, please record the general description of the original location here. This should start with the country (United Kingdom, or look up other accepted country names here https://www.ebi.ac.uk/ena/browser/view/ERC000053), but also include more specific locations (e.g., 'Barton’s Pond') ranging from least to most specific and separated by | character, e.g., “United Kingdom | East Anglia | Norfolk | Norwich | University of East Anglia | UEA Broad”. It is important to give the name of the site here if possible. This information is important for regulatory compliance checks. Leave this field blank if it is not applicable", 
            "type": "text_field",
            "mandatory": "optional", 
            "ENA_submission": true
        },
        "DECIMAL_LATITUDE":{
            "descritpion": "In decimal degrees, between -90 and 90. We advise that locations are specified to a minimum of 3 decimal places (https://en.wikipedia.org/wiki/Decimal_degrees).",
            "type": "text_field",
            "mandatory": "mandatory", 
            "ENA_submission": true,
            "ena_unit": "DD" 
        },
        "DECIMAL_LONGITUDE":{
            "descritpion": "In decimal degrees, between -90 and 90. We advise that locations are specified to a minimum of 3 decimal places (https://en.wikipedia.org/wiki/Decimal_degrees).",
            "type": "text_field",
            "mandatory": "mandatory", 
            "ENA_submission": true,
            "ena_unit": "DD" 
        },
        "GRID_REFERENCE":{
            "description": "Information to geolocate the sample area, preferably with a map or standardised geolocation reference, e.g., OS GRID REF: SP45998 08751. https://osmaps.ordnancesurvey.co.uk/ is useful to map lat-long to grid references", 
            "type": "text_field", 
            "mandatory": "optional",
            "ENA_submission": false
        },
        "HABITAT":{
            "description":"Any comments about the location, habitat or substrate, e.g., damp mossy ground in moderate shade. If substrate is living and there is a chance that it is included in the sample, add this to the SYMBIONT category. We recommend using terms from the ENVO ontology. If the specimen is from a zoo or botanic garden, you can add its original habitat to “OTHER_INFORMATION” but here, please only capture its habitat at the time of collection (e.g., “reptile cage at London Zoo”).",
            "type": "text_field", 
            "mandatory": "mandatory",
            "ENA_submission": true
        },
        "DEPTH":{
            "description":"Depth below (water body) surface, supplied in metres. This is not the absolute depth of the water body. Do not supply the unit, e.g., use 200 for 200 m below sea level, 100-200 for 100-200 m range below sea level, etc. Leave this field blank if the depth was not recorded or it is not an applicable field",
            "type": "text_field",
            "mandatory": "mandatory", 
            "ENA_submission": true,
            "ena_unit": "m" 
        },
        "ELEVATION":{
            "description":"Altitude above sea level, supplied in metres. Do not supply the unit, e.g., use 200 for 200 m above sea level, 100- 200 for 100-200 m range above sea level, etc. Please supply elevation of water surface for inland water bodies. Leave this field blank if the elevation was not recorded or it is not an applicable field. For specimens isolated below the earth surface in sediment or soil, please provide a negative value in metres corresponding to sampling depth.",
            "type": "text_field",
            "mandatory": "mandatory", 
            "ENA_submission": true,
            "ena_unit": "m" 
        },
        "TIME_OF_COLLECTION":{
            "description": "Time of day of sample collection in 24-hour clock format, with hours and minutes separated by colon e.g., 13:35, 04:53, etc. This should be in GMT/UTC. This field may be particularly relevant for RNAseq but it is not mandatory. Leave this field blank if the time was not recorded",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": false

        },
        "DESCRIPTION_OF_COLLECTION_METHOD":{
            "description":"A detailed as possible description of the sample collection methods, e.g., 'caught with fibre net within densely wooded area, and immediately placed into the collection container'.",
            "type": "text_area_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "DIFFICULT_OR_HIGH_PRIORITY_SAMPLE":{
            "description":"Species/samples that are difficult to collect (rare) or high priority to push through sequencing for any reason",
            "type": "text_choice_field", 
            "mandatory": "optional",
            "options":["SANGER INSTITUTE","EARLHAMHIGH_PRIORITY","DIFFICULT","NOT_APPLICABLE","NOT_PROVIDED","NOT_COLLECTED","FULL_CURATION"],
            "ENA_submission": false
        },
        "IDENTIFIED_BY":{
            "description":"Enter the name of the person or people who identified the sample to species level. Use ALL CAPs, and separate names with | (vertical pipe symbol), e.g., 'CAROLUS LINNAEUS | JEAN-BAPTISTE LAMARCK'.",
            "type": "text_area_field", 
            "mandatory":"mandatory",
            "ENA_submission": true
        },
        "IDENTIFIER_AFFILIATION":{
            "description":"Free text field to supply the university, institution, or society that is responsible for the collected specimen. This is typically the society or institution of the person(s) specified in the IDENTIFIED_BY field. If multiple people are specified in IDENTIFIED_BY, ensure that their institutional affiliations are also separated by a vertical pipe symbol. Position in the list of affiliations should match the person in the same position in the list of names (e.g., 'Person A | Person X | Person C” will have their affiliations as: “Institute A | Institute X | Institute C'. If multiple people are listed but all from the same affiliation, no need to repeat the affiliation.",
            "type": "text_area_field", 
            "mandatory":"mandatory",
            "ENA_submission": true
        },
        "IDENTIFIED_HOW":{
            "description":"Indicate what method(s) were used to identify the specimen to the nominal species (e.g., morphology, ITS barcoding). This is free text and should include reference to an authoritative key if possible. If the identification is by a taxon expert, note that here and ensure the name of that person is in the IDENTIFIED_BY column.",
            "type": "text_area_field", 
            "mandatory":"mandatory",
            "ENA_submission": false
        },
        "SPECIMEN_ID_RISK":{ 
            "description":"Indicate if there is any risk that the SPECIMEN_ID provided does not reflect a single genetic entity OR the species names it has been submitted under",
            "type": "text_choice_field", 
            "mandatory":"mandatory",
            "options":["Y","N"],
            "ENA_submission": false
        },
        "PRESERVED_BY":{
            "description":"Name of person that carried out the preservation, supplied in CAPITALS. Multiple preserver names should be separated by a | character.",
            "type": "text_area_field", 
            "mandatory":"mandatory",
            "ENA_submission": false
        },
        "PRESERVER_AFFILIATION":{
            "description":"Free text field to supply the university, institution, or society that is responsible for the collected specimen. This is typically the society or institution of the person(s) specified in the PRESERVED_BY field. If multiple people are specified in PRESERVED_BY, ensure that their institutional affiliations are also separated by a vertical pipe symbol. Position in the list of affiliations should match the person in the same position in the list of names (e.g., Person A | Person X | Person C will have their affiliations as: (Institute A | Institute X | Institute C). If multiple people are listed but all from the same affiliation, there is no need to repeat the affiliation.",
            "type": "text_area_field", 
            "mandatory":"mandatory",
            "ENA_submission": false
        },
        "PRESERVATION_APPROACH":{
            "description":"e.g., snap frozen, dry ice, ethanol/dry ice slurry, in RNALater, lyophilised, air dried, etc.",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": false
        },
        "PRESERVATIVE_SOLUTION:":{
            "description":"Suspension liquid used to preserve the sample, e.g., RNALater, RLT Buffer, DESS. If no preservative was used, this field should be left blank.",
            "type": "text_field",
            "mandatory": "optional",
            "ENA_submission": false
        },
        "TIME_ELAPSED_FROM_COLLECTION_TO_PRESERVATION":{
            "description":"some organisms may be held living in collection for a period of time for starvation or other factors. This entry should be specified in hours, but no unit, e.g., 0.5 for half an hour, 3 for 3 hours, etc.",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": false
        },
        "DATE_OF_PRESERVATION":{
            "description":"Date on which the species was preserved. Please use YYYY-MM-DD format",
            "type": "text_field",
            "mandatory": "mandatory",
            "ENA_submission": false
        },
        "SIZE_OF_TISSUE_IN_TUBE":{ 
            "description":"How large the sample in the tube is.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["VS","S","M","L","SINGLE_CELL","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED"],
            "ENA_submission": false
        },
        "TISSUE_REMOVED_FOR_BARCODING":{ 
            "description":"Instructions for appropriate Molecular Barcoding SOPs has to be arranged by the species ambassador with the Barcoding partner , noting that barcoding requires materials in specific tube or plate types.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["Y","N","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED"],
            "ENA_submission": false
        },
        "TUBE_OR_WELL_ID_FOR_BARCODING":{
            "description":"This is either the well number on a plate (there are 96 wells per tissue plate) OR the barcode/unique identifier on the tube containing the tissue sample.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["Y","N","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED"],
            "ENA_submission": false
        },
        "TISSUE_FOR_BARCODING":{ 
            "description":"What part of the organism was dissected for DNA barcoding (e.g. leg, soft-body tissue etc.). Muscle tissue is ideal for barcoding.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["WHOLE_ORGANISM","HEAD","THORAX","ABDOMEN","CEPHALOTHORAX","BRAIN","EYE", "FAT_BODY","INTESTINE","BODYWALL","TERMINAL_BODY","ANTERIOR_BODY","MID_BODY","POSTERIOR_BODY","HEPATOPANCREAS","LEG","BLOOD","LUNG","HEART","KIDNEY","LIVER","ENDOCRINE_TISSUE","SPLEEN","STOMACH","PANCREAS","MUSCLE","MODULAR_COLONY","TENTACLE","FIN","SKIN","SCAT","EGGSHELL","SCALES","MOLLUSC_FOOT","HAIR","GILL_ANIMAL","OVIDUCT","GONAD","OVARY_ANIMAL","TESTIS","SPERM_SEMINAL_FLUID","EGG","WHOLE_PLANT","SEEDLING","SEED","LEAF","FLOWER","BLADE","STEM","PETIOLE","SHOOT","BUD","THALLUS_PLANT","BRACT","MYCELIUM","MYCORRHIZA","SPORE_BEARING_STRUCTURE","HOLDFAST_FUNGI","STIPE","CAP","GILL_FUNGI","THALLUS_FUNGI","SPORE","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED","UNICELLULAR_ORGANISMS_IN_CULTURE","MULTICELLULAR_ORGANISMS_IN_CULTURE"],
            "ENA_submission": false
        },
        "BARCODE_PLATE_PRESERVATIVE":{
            "description":"Typically, animal samples will be submerged in 70% ethanol, plant tissue will be preserved in silica gel, and fungal tissue will be frozen or lyophilized. Record the volume, concentration, and type of preservative/method of preservation used here",
            "type": "text_field", 
            "mandatory":"mandatory",
            "ENA_submission": false
        },
        "TISSUE_REMOVED_FOR_BIOBANKING":{ 
            "description":"Select from drop down menu “Y” or “N”. Instructions for appropriate Biobanking SOPs has to be arranged by the species ambassador with the Biobanking partner, noting that biobanking requires materials in specific tube or plate types.",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["Y","N","NOT_COLLECTED","NOT_APPLICABLE"],
            "ENA_submission": false
        },
        "TISSUE_VOUCHER_ID_FOR_BIOBANKING":{
            "description":"Accession number of frozen, biobanked material from the sequenced specimen",
            "type": "text_field", 
            "mandatory":"mandatory",
            "ENA_submission": false
        },
        "TISSUE_FOR_BIOBANKING":{ 
            "description":"what part of the organism was dissected for biobanking (e.g. leg, soft-body tissue etc.)",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["WHOLE_ORGANISM","HEAD","THORAX","ABDOMEN","CEPHALOTHORAX","BRAIN","EYE", "FAT_BODY","INTESTINE","BODYWALL","TERMINAL_BODY","ANTERIOR_BODY","MID_BODY","POSTERIOR_BODY","HEPATOPANCREAS","LEG","BLOOD","LUNG","HEART","KIDNEY","LIVER","ENDOCRINE_TISSUE","SPLEEN","STOMACH","PANCREAS","MUSCLE","MODULAR_COLONY","TENTACLE","FIN","SKIN","SCAT","EGGSHELL","SCALES","MOLLUSC_FOOT","HAIR","GILL_ANIMAL","OVIDUCT","GONAD","OVARY_ANIMAL","TESTIS","SPERM_SEMINAL_FLUID","EGG","WHOLE_PLANT","SEEDLING","SEED","LEAF","FLOWER","BLADE","STEM","PETIOLE","SHOOT","BUD","THALLUS_PLANT","BRACT","MYCELIUM","MYCORRHIZA","SPORE_BEARING_STRUCTURE","HOLDFAST_FUNGI","STIPE","CAP","GILL_FUNGI","THALLUS_FUNGI","SPORE","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED","UNICELLULAR_ORGANISMS_IN_CULTURE","MULTICELLULAR_ORGANISMS_IN_CULTURE"],
            "ENA_submission": false
        },
        "DNA_REMOVED_FOR_BIOBANKING":{ 
            "description":"Select from drop down menu “Y” (yes) or “N” (no).",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["Y", "N","NOT_COLLECTED","NOT_APPLICABLE","NOT_PROVIDED"],
            "ENA_submission": false
        },
        "DNA_VOUCHER_ID_FOR_BIOBANKING":{
            "description":"Accession number of DNA biobanked from the sequenced specimen.",
            "type":"text_field",
            "mandatory":"mandatory",
            "ENA_submission":false
        },
        "PURPOSE_OF_SPECIMEN":{ 
            "description":"",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["REFERENCE_GENOME","SHORT_READ_SEQUENCING","DNA_BARCODING_ONLY","RNA_SEQUENCING","PROXY_VOUCHERING_ONLY"],
            "ENA_submission":false
        },
        "HAZARD_GROUP":{ 
            "description":"If the specimen needs to be processed in a containment level 1,2, or 3 lab",
            "type": "text_choice_field", 
            "mandatory": "mandatory",
            "options":["HG1","HG2","HG3"],
            "ENA_submission":false
        },
        "REGULATORY_COMPLIANCE":{ 
            "description":"Note that ERGA will not be able to process further any samples where N is entered",
            "type": "text_choice_field",
            "mandatory": "mandatory",
            "options":["Y","N","NOT_APPLICABLE"],
            "ENA_submission":false
        },
        "VOUCHER_ID":{
            "description":"Accession number of voucher material from the sequenced specimen",
            "type":"text_field",
            "mandatory":"mandatory",
            "ENA_submission":true
        },
        "INDIGENOUS_RIGHTS_APPLICABLE":{ 
            "description":"Mandatory information upon if indigenious rights are applicable to the sample/the species the sample was derived from",
            "type": "text_choice_field",
            "mandatory": "mandatory",
            "options":["Y","N"],
            "ENA_submission":false
        },
        "INDIGENOUS_RIGHTS_DEF":{
            "description":"Free text, Please state which rights are applicable if the previous column says yes, else NA",
            "type":"text_area_field",
            "mandatory":"optional",
            "ENA_submission":false
        },
        "ASSOCIATED_TRADITIONAL_KNOWLEDGE_APPLICABLE":{ 
            "description":"Mandatory information upon if indigenious rights are applicable to the sample/the species the sample was derived from",
            "type": "text_choice_field",
            "mandatory": "mandatory",
            "options":["Y","N"],
            "ENA_submission":false
        },
        "ASSOCIATED_TRADITIONAL_KNOWLEDGE_LABEL":{
            "description":"",
            "type":"text_field",
            "mandatory": "mandatory",
            "ENA_submission":false
        },
        "ASSOCIATED_TRADITIONAL_KNOWLEDGE_CONTACT":{
            "description":"Provide reference, free text allowed, could be linked to an ORCID",
            "type":"text_area_field",
            "mandatory":"optional",
            "ENA_submission":false
        },
        "ETHICS_PERMITS_MANDATORY":{ 
            "description":"Mandatory information upon if an ethics permit is needed to sample/sequence/voucher/biobank the sample/the species the sample was derived from",
            "type": "text_choice_field",
            "mandatory": "mandatory",
            "options":["Y","N"],
            "ENA_submission":false
        },
        "ETHICS_PERMITS_DEF":{
            "description":"Free text explaining permits, permit issuing entity and permit number",
            "type":"text_area_field",
            "mandatory":"optional",
            "ENA_submission":false
        },
        "SAMPLING_PERMITS_MANDATORY":{ 
            "description":"Mandatory information upon if sampling permits are needed to sample/sequence/voucher/biobank the sample/the species the sample was derived from",
            "type": "text_choice_field",
            "mandatory": "mandatory",
            "options":["Y","N"],
            "ENA_submission":false
        },
        "SAMPLING_PERMITS_DEF":{
            "description":"Free text explaining permits, permit issuing entity and permit number.",
            "type": "text_area_field",
            "mandatory": "optional",
            "ENA_submission":false
        },
        "NAGOYA_PERMITS_MANDATORY":{ 
            "description":"Mandatory information upon if a permit in compliance with the Nagoya Protocol on Access to Genetic Resources and the Fair and Equitable Sharing of Benefits Arising from their Utilization to the Convention on Biological Diversity is needed for the sample in question/the species the sample was derived from",
            "type": "text_choice_field",
            "mandatory": "mandatory",
            "options":["Y","N"],
            "ENA_submission":false
        },
        "NAGOYA_PERMITS_DEF":{
            "description":"Free text explaining permits, permit issuing entity and permit number.",
            "type": "text_area_field",
            "mandatory": "optional",
            "ENA_submission":false
        },
        "OTHER_INFORMATION":{
            "description":"Free text field for further relevant information not captured by the other fields. This is a place also for partners to flag species that should be prioritized in the sequencing queue",
            "type": "text_area_field",
            "mandatory": "optional",
            "ENA_submission":false
        },
        "TKLabels":{
            "description":"",
            "type": "text_choice_field",
            "mandatory": ["optional", "mandatory"],
            "options":["NOT_APPLICABLE","TK Attribution","TK Clan","TK Family","TK Multiple Communities","TK Community Voice", "TK Creative","TK Verified","TK Seasonal","TK Women General","TK Men General","TK Men Restricted","TK Women Restricted","TK Secret/Sacred","TK Open to Commercialisation","TK Non-Commercial","TK Community Use Only","TK Outreach","TK Open to Collaboration","BC Provenance","BC Multiple Communities","BC Clan","BC Consent Verified","BC Research Use","BC Open to Collaboration","BC Open to Commercialisation","BC Non-Commercial"],
            "ENA_submission":false
        }
    }
}
